# coding: utf-8
# 深圳地铁线路选择，部署到手机用pydroid

import networkx
import numpy as np
import matplotlib.pyplot as plt


def change_to_li(s):
    li = s.split('\n')
    li = [x.strip('站').strip() for x in li]
    print(li)
    return


if __name__ == '__main__':
    line11 = \
        np.array(['碧头', '松岗', '后亭', '沙井', '马安山', '塘尾', '桥头', '福永', '机场北', '机场', '碧海湾', '宝安',
                  '前海湾', '南山', '后海', '红树湾南', '车公庙', '福田'])

    line1 = \
        np.array(['罗湖', '国贸', '老街', '大剧院', '科学馆', '华强路', '岗厦', '会展中心', '购物公园', '香蜜湖', '车公庙',
                  '竹子林', '侨城东', '华侨城', '世界之窗', '白石洲', '高新园', '深大', '桃园', '大新', '鲤鱼门', '前海湾',
                  '新安', '宝安中心', '宝体', '坪洲', '西乡', '固戍', '后瑞', '机场东'])

    line2 = \
        np.array(['赤湾', '蛇口港', '海上世界', '水湾', '东角头', '湾厦', '海月', '登良', '后海', '科苑', '红树湾',
                  '世界之窗', '侨城北', '深康', '安托山', '侨香', '香蜜', '香梅北', '景田', '莲花西', '福田', '市民中心',
                  '岗厦北', '华强北', '燕南', '大剧院', '湖贝', '黄贝岭', '新秀'])

    line3 = \
        np.array(['益田', '石厦', '购物公园', '福田', '少年宫', '莲花村', '华新', '通新岭', '红岭', '老街', '晒布',
                  '翠竹', '田贝', '水贝', '草埔', '布吉', '木棉湾', '大芬', '丹竹头', '六约', '塘坑', '横岗', '永湖',
                  '荷坳', '大运', '爱联', '吉祥', '龙城广场', '南联', '双龙'])

    line4 = \
        np.array(['福田口岸', '福民', '会展中心', '市民中心', '少年宫', '莲花北', '上梅林', '民乐', '白石龙', '深圳北',
                  '红山', '上塘', '龙胜', '龙华', '清湖'])

    line5 = \
        np.array(['前海湾', '临海', '宝华', '宝安中心', '翻身', '灵芝', '洪浪北', '兴东', '留仙洞', '西丽', '大学城',
                  '塘朗', '长岭陂', '深圳北', '民治', '五和', '坂田', '杨美', '上水径', '下水径', '长龙', '布吉',
                  '百鸽笼', '布心', '太安', '怡景', '黄贝岭'])

    line7 = \
        np.array(['西丽湖', '西丽', '茶光', '珠光', '龙井', '桃源村', '深云', '安托山', '农林', '车公庙', '上沙', '沙尾',
                  '石厦', '皇岗村', '福民', '皇岗口岸', '福邻', '赤尾', '华强南', '华强北', '华新', '黄木岗', '八卦岭',
                  '红岭北', '笋岗', '洪湖', '田贝', '太安'])

    line9 = \
        np.array(['红树湾南', '深湾', '深圳湾公园', '下沙', '车公庙', '香梅', '景田', '梅景', '下梅林', '梅村', '上梅林',
                  '孖岭', '银湖', '泥岗', '红岭北', '园岭', '红岭', '红岭南', '鹿丹村', '人民南', '向西村', '文锦'])

    g = networkx.Graph()
    # all_line = np.hstack((line1, line2, line3, line4, line5, line7, line9, line11))
    all_edge_origin = np.array([line1, line2, line3, line4, line5, line7, line9, line11])
    # for i1 in all_line:
    #     g.add_node(i1)
    # for i1 in all_edge_origin:
    #     g.add_nodes_from(i1)
    # print(g.nodes)
    # g.add_cycle(line1)

    for line in all_edge_origin:
        g.add_cycle(line)
        g.remove_edge(line[0], line[-1])
        # break

    # change_to_li('''
    # 站点:
    # 益田站
    # 石厦站
    # 购物公园站
    # 福田站
    # 少年宫站
    # 莲花村站
    # 华新站
    # 通新岭站
    # 红岭站
    # 老街站
    # 晒布站
    # 翠竹站
    # 田贝站
    # 水贝站
    # 草埔站
    # 布吉站
    # 木棉湾站
    # 大芬站
    # 丹竹头站
    # 六约站
    # 塘坑站
    # 横岗站
    # 永湖站
    # 荷坳站
    # 大运站
    # 爱联站
    # 吉祥站
    # 龙城广场站
    # 南联站
    # 双龙站''')  # http://www.szmc.net/ver2/operating/search?scode=0601&xl=6

    go_path = networkx.shortest_path(g, '大学城', '景田')
    print(go_path)
    #
    #
    # networkx.draw(g)
    # plt.show()
