# 深圳地铁线路选择，部署到手机用pydroid

import networkx
import numpy as np

if __name__ == '__main__':
    line11 = \
        np.array(['碧头', '松岗', '后亭', '沙井', '马安山', '塘尾', '桥头', '福永', '机场北', '机场', '碧海湾', '宝安',
                  '前海湾', '南山', '后海', '红树湾南', '车公庙', '福田'])
    line1 = \
        np.array(['罗湖', '国贸', '老街', '大剧院', '科学馆', '华强路', '岗厦', '会展中心', '购物公园', '香蜜湖', '车公庙',
                  '竹子林', '侨城东', '华侨城', '世界之窗', '白石洲', '高新园', '深大', '桃园', '大新', '鲤鱼门', '前海湾',
                  '新安', '宝安中心', '宝体', '坪洲', '西乡', '固戍', '后瑞', '机场东'])

    line2 = \
        np.array(['赤湾站', '蛇口港站', '海上世界站', '水湾站', '东角头站', '湾厦站', '海月站', '登良站', '后海站', '科苑站',
                  '红树湾站', '世界之窗站', '侨城北站', '深康站', '安托山站', '侨香站', '香蜜站', '香梅北站', '景田站',
                  '莲花西站', '福田站', '市民中心站', '岗厦北站', '华强北站', '燕南站', '大剧院站', '湖贝站', '黄贝岭站',
                  '新秀站'])
    g = networkx.Graph()
    g.add_node('碧头')
    print(g.nodes)
